Tekla Open API Reference for Tekla Structures 2025
WpfComponentCatalog.SelectedName Property
 Gets or sets the selected component name in the control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string SelectedName { get; set; }
Public Property SelectedName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
WpfComponentCatalog Class
Tekla.Structures.Dialog.UIControls Namespace